In [1]:
import json

In [2]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [3]:
result = json.loads(obj)

In [4]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [5]:
asjson = json.dumps(result
                   )

In [6]:
import pandas as pd

In [7]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [8]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [9]:
data = pd.read_json('examples/example.json')

In [10]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [12]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [13]:
len(tables
   )

1

In [14]:
failures = tables[0
                 ]

In [15]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"